---
kind: property
id: P:Autodesk.Revit.DB.BaseExportOptions.PreserveCoincidentLines
source: html/2bed75a3-2098-65a4-a170-4cd2d11bfb0f.htm
---
# Autodesk.Revit.DB.BaseExportOptions.PreserveCoincidentLines Property

Whether or not to preserve coincident lines.
 Default value is false.

## Syntax (C#)
```csharp
public bool PreserveCoincidentLines { get; set; }
```